{
  "name": "KAMDEV CHOUDHARY (KD)",
  "aboutMe": "I am a passionate developer with a deep curiosity for building innovative solutions. Although my current job profile differs from my dream career in tech, I see it as a stepping stone toward my goals. I started my coding journey last year and have already created some exciting projects, especially in the academic field, as a hobby. Beyond coding, I enjoy exploring new technologies, solving challenging problems, and collaborating with like-minded individuals to bring ideas to life. My ultimate aim is to blend creativity and technology to make a meaningful impact.",
  "headlineTexts": ["MERN Stack", "JavaScript", "Full Stack", "React Native"],
  "education": {
    "basic": [
      {
        "level": "Under Graduation",
        "stream": "Bachelor of Science _ Mathematics",
        "institute": "Ranchi University, Ranchi",
        "year": "2021",
        "gradeSystem": "Percentage",
        "grade": "78.28 %"
      },
      {
        "level": "12th",
        "stream": "Intermediate of Science _ PCM",
        "institute": "Jawahar Navodaya Vidyalaya BIT Mesra, Ranchi",
        "year": "2017",
        "gradeSystem": "Percentage",
        "grade": "81 %"
      },
      {
        "level": "10th",
        "stream": "Science",
        "institute": "Jawahar Navodaya Vidyalaya BIT Mesra Ranchi",
        "year": "2015",
        "gradeSystem": "CGPA",
        "grade": "9 CGPA"
      }
    ],
    "certificates": [
      {
        "name": "Desktop Publishing",
        "institute": "RUDSET Institute, Silli, Ranchi",
        "duration": "45 Days",
        "period": "01-Apr-2019 to 16-May-2019",
        "link": "",
        "skills": [
          "Basic Computing",
          "Photoshop",
          "Page Layout",
          "Designing",
          "Basic Typing"
        ],
        "achievement": "Successfully completed with top performance in practical assignments.",
        "projects": "Created sample business cards, posters, and booklets.",
        "mode": "Offline"
      },

      {
        "name": "Full-Stack Web Development",
        "institute": "freeCodeCamp",
        "duration": "6 Months",
        "period": "2024",
        "link": "https://www.freecodecamp.org",
        "skills": ["HTML", "CSS", "JavaScript", "Node.js", "MongoDB"],
        "achievement": "Certified as a Full-Stack Web Developer.",
        "projects": "Built an e-commerce website with authentication and payment integration.",
        "mode": "Online"
      },
      {
        "name": "Professional Developmemt",
        "institute": "Anudip Foundation",
        "duration": "1 Months",
        "period": "21-July-2024 to 10-Sep-2024",
        "link": "https://www.coursera.org/mathematics-for-machine-learning",
        "skills": ["Linear Algebra", "Calculus", "Probability"],
        "achievement": "Completed with a focus on practical implementation in Python.",
        "projects": "Implemented gradient descent optimization algorithms.",
        "mode": "Online"
      },
      {
        "name": "Youth Employeement Training",
        "institute": "TCS",
        "duration": "01 Month",
        "period": "",
        "link": "",
        "skills": [],
        "achievement": "",
        "projects": "",
        "mode": "Online"
      }
    ],
    "skills": [
      {
        "name": "MS Office",
        "description": "Proficient in MS Office tools like Word, Excel, and PowerPoint.",
        "proficiency": "Expert",
        "relatedProjects": [
          "Data analysis using Excel",
          "Project presentations using PowerPoint"
        ],
        "certifications": ["MS Office Specialist"]
      }
    ]
  },
  "work": [
    {
      "company": "Dakshana Foundation",
      "address": "Kadus, Pune, 412404",
      "duration": "08-May-2022 to Present",
      "positions": [
        {
          "position": "Academic Officer",
          "location": "Pune, Maharashtra",
          "startDate": "13-Sept-2023",
          "endDate": "Present",
          "description": [
            "Managing and overseeing various academic activities at Dakshana Valley, Pune, to ensure smooth operation and academic excellence.",
            "Coordinating educational programs aimed at supporting underprivileged students in their preparation for competitive exams.",
            "Conducting bimonthly exams, including question paper creation, online reviews, scheduling, result compilation, and detailed performance analysis.",
            "Preparing and reviewing test papers to align with curriculum objectives and difficulty levels.",
            "Providing one-on-one guidance to scholars to address academic challenges and improve performance.",
            "Analyzing student performance trends to predict outcomes and devise strategies for improvement.",
            "Collaborating with web developer and the IT team to optimize online platforms for test conduction, result management, and other academic activities. Also help them to enhance the functionality and secuirity of online platforms.",
            "Handling application forms, verifying eligibility criteria, and ensuring a seamless registration process for JEE & NEET exams.",
            "Collaborating with faculty and administrative staff to plan schedules and allocate resources effectively.",
            "Maintaining detailed academic records and reports for tracking progress and decision-making."
          ],
          "skills": ["Excel", "Word", "Powerpoint"]
        },
        {
          "position": "Academic Program Coordinator",
          "location": "Bengaluru, Karnataka",
          "startDate": "01-Sept-2022",
          "endDate": "12-Sept-2023",
          "description": [
            "Coordinated a batch of 240 scholars in educational programs, ensuring the smooth execution of academic and non-academic activities.",
            "Monitored student progress through regular assessments and provided personalized support to enhance their academic performance.",
            "Counseled underperforming scholars to identify challenges and devise strategies to improve results.",
            "Conducted detailed result analysis to identify patterns, strengths, and areas for improvement across the cohort.",
            "Created and reviewed test papers to ensure alignment with academic goals and standards.",
            "Organized and facilitated online tests in environments with limited network connectivity and technical challenges.",
            "Worked closely with students and faculty to address academic and personal issues, fostering a supportive learning environment.",
            "Developed and implemented strategies to improve attendance, engagement, and overall performance among scholars.",
            "Collaborated with administrative staff to schedule activities, allocate resources, and maintain program efficiency."
          ],
          "skills": ["Excel", "Word", "Powerpoint"]
        },
        {
          "position": "Academic Program Coordinator",
          "location": "Hyderabad, Telangana",
          "startDate": "08-May-2022",
          "endDate": "28-Aug-2022",
          "description": [
            "As a start of my journey with Dakshana Foundation I managed a batch of 61 students preparing for JEE Advanced, overseeing their academic and non-academic activities.",
            "Handled class scheduling, examinations, results and other academic initiatives.",
            "Played a crucial role in supporting students' academic development during the initial phase of my tenure.",
            "Help the students to analyse the result and predict for JEE seat possibilities.",
            "Coucelling the poor performance scholars to improve result."
          ],
          "skills": ["Excel", "Word", "Powerpoint"]
        }
      ]
    },
    {
      "company": "Deccan iServices Pvt Ltd.",
      "address": "Ranchi",
      "duration": "28-Aug-2021 to 01-May-2022",
      "positions": [
        {
          "position": "Financial Processor",
          "location": "Ranchi",
          "startDate": "28-August-2021",
          "endDate": "01-May-2022",
          "description": [
            "Handled financial (loan) related documents to make them available online.",
            "The role involved knowledge processing outsourcing (KPO), ensuring accurate and efficient handling of complex and detailed data.",
            "Collaborated with team members to streamline processes and improve data accuracy.",
            "Ensured confidentiality and security of sensitive financial information during processing."
          ],
          "skills": ["Typing", "Accuracy"]
        }
      ]
    }
  ],
  "projects": [
    {
      "name": "Edu Portal for Dakshana Foundation",
      "time": "06 Months",
      "description": "A platform designed for managing educational resources and student interactions, aimed at providing support for Dakshana scholars.",
      "technologies_used": [
        "React",
        "Node.js",
        "Express",
        "MUI",
        "AWS S3",
        "Crypto",
        "Docx",
        "excelJs",
        "Framer Motion",
        "Lodash",
        "Redux",
        "Recharts",
        "..."
      ],
      "role": "Full-stack Developer",
      "responsibilities": [
        "Developed the front-end using React and MUI components.",
        "Implemented authentication and authorization with JWT.",
        "Designed and integrated the database schema in MongoDB.",
        "Handled file uploads and storage using AWS S3."
      ],
      "features": [
        "Admin dashboard for managing scholars and content.",
        "File upload functionality with AWS S3 integration."
      ],
      "challenges_faced": [
        "Integrating file upload functionality with S3 storage.",
        "Handling performance issues with large datasets."
      ],
      "outcome_impact": "The platform successfully improved the management of educational resources, providing a streamlined experience for both admins and scholars.",
      "links": {
        "live_project": "https://lms.dakshana.org",
        "github_repository": "https://github.com/kamdev-choudhary/dak-edu-portal"
      },
      "collaborators": [{ "name": "none", "role": "" }],
      "completion_date": "October 2024",
      "skills_gained": [
        "Full-stack development",
        "RESTful API design",
        "Cloud storage integration (AWS S3)"
      ]
    }
  ],
  "contact": {
    "email": "kamdevchoudhary@gmail.com",
    "phone": "+918340644088",
    "instagram": "kd_6799_",
    "linkedIn": "https://linkedin.com/in/kamdev-choudhary",
    "github": "https://github.com/kamdev-choudhary",
    "address": "Banta, Silli, Ranchi (Jharkhand), Pin-835102"
  },
  "website": {
    "packages": [
      {
        "name": "React",
        "description": "A JavaScript library for building fast, interactive, and dynamic user interfaces."
      },
      {
        "name": "Vite",
        "description": "A modern front-end build tool for fast development and optimized production workflows."
      },
      {
        "name": "MUI",
        "description": "A comprehensive library of React components implementing Google's Material Design guidelines."
      },
      {
        "name": "Axios",
        "description": "A promise-based HTTP client for handling API requests and responses seamlessly."
      },
      {
        "name": "Framer Motion",
        "description": "A feature-rich animation library for React to create fluid and responsive motion effects."
      },
      {
        "name": "Sweet Alert 2",
        "description": "A sleek and customizable replacement for JavaScript alert boxes with modern UI support."
      },
      {
        "name": "React Spinner",
        "description": "A library for adding visually appealing loader animations in React applications."
      },
      {
        "name": "Google Script",
        "description": "A scripting platform for automating tasks and integrating with Google Workspace services. Used for saving email, password, and message in a spreadsheet for the Contact Us feature."
      }
    ],
    "icon": { "name": "icon8", "desciption": "" }
  },
  "location": {
    "permament": {
      "address1": "H.No 91, Banta",
      "address2": "Bantahajam, Silli",
      "city": "Ranchi",
      "state": "Jharkhand",
      "pincode": "835102"
    },
    "present": {
      "address1": "413, Dakshana Foundation",
      "address2": "Kadus, Rajgurnagar",
      "city": "Pune",
      "state": "Maharashtra",
      "pincode": "412404"
    }
  },
  "hobbies": ["Playing Chess", "Music"],
  "extra": [{ "name": "" }]
}
