[
  {
    "company": "Dakshana Foundation",
    "address": "Kadus, Pune , 412404",
    "duration": "08-May-2022 to Present",
    "multiplePosition": true,
    "positions": [
      {
        "position": "Academic Officer",
        "location": "Pune, Maharashtra",
        "startDate": "13-Sept-2023",
        "endDate": "present",
        "description": [
          "Currently working as an Academic Officer in the Pune Valley, overseeing and supporting various academic initiatives. I have been responsible for implementing and managing educational programs that align with the foundation's mission to support underprivileged students in their academic journeys."
        ]
      },
      {
        "position": "Academic Program Coordinator",
        "location": "Bengaluru, Karnataka",
        "startDate": "01-Sept-2022",
        "endDate": "12-Sept-2023",
        "description": [
          "As an Academic Program Coordinator in Bengaluru, I played a crucial role in coordinating educational programs, monitoring progress, and ensuring smooth execution of activities aimed at enhancing the academic skills of students. I worked closely with students and faculty to provide the necessary support for their success."
        ]
      },
      {
        "position": "Academic Program Coordinator",
        "location": "Hyderabad, Telangana",
        "startDate": "08-May-2022",
        "endDate": "28-Aug-2022",
        "description": [
          "As starting journey with Dakshana Foundation. I Played a crutial role as an Academic Program in coordinator.",
          "Handling a batch of strength 61 preparting for JEE Advanced in their academic and non-academic activities.",
          "Academic activities included their class scheduling, exam and more"
        ]
      }
    ]
  },
  {
    "company": "Deccan iServices Pvt Ltd.",
    "address": "Ranchi",
    "duration": "28-Aug-2021 to 01-May-2022",
    "positions": [
      {
        "position": "Financial Processor",
        "location": "Ranchi",
        "startDate": "28-August-2021",
        "endDate": "01-May-2022",
        "description": [
          "Worked as a Financial Processor, handling financial transactions, processing invoices, and ensuring accurate financial records. My role involved managing financial data, coordinating with various departments to ensure proper billing and documentation, and assisting in maintaining the company's financial health."
        ]
      }
    ]
  }
]
