[
  {
    "company": "Dakshana Foundation",
    "address": "Kadus, Pune, 412404",
    "duration": "08-May-2022 to Present",
    "positions": [
      {
        "position": "Academic Officer",
        "location": "Pune, Maharashtra",
        "startDate": "13-Sept-2023",
        "endDate": "Present",
        "description": [
          "Managing and overseeing various academic activities at the Dakshana Valley, Pune.",
          "Coordinating educational programs to support underprivileged students in their academic journeys.",
          "Conducting bimonthly exams, including scheduling, result compilation, and analysis.",
          "Supporting non-academic activities as needed.",
          "Performing predictions and analyses based on academic performance data."
        ]
      },
      {
        "position": "Academic Program Coordinator",
        "location": "Bengaluru, Karnataka",
        "startDate": "01-Sept-2022",
        "endDate": "12-Sept-2023",
        "description": [
          "Coordinated educational programs and ensured smooth execution of academic activities.",
          "Monitored student progress and provided support to enhance their academic skills.",
          "Worked closely with students and faculty to facilitate their success."
        ]
      },
      {
        "position": "Academic Program Coordinator",
        "location": "Hyderabad, Telangana",
        "startDate": "08-May-2022",
        "endDate": "28-Aug-2022",
        "description": [
          "Managed a batch of 61 students preparing for JEE Advanced, overseeing their academic and non-academic activities.",
          "Handled class scheduling, examinations, and other academic initiatives.",
          "Played a crucial role in supporting students' academic development during the initial phase of my tenure."
        ]
      }
    ]
  },
  {
    "company": "Deccan iServices Pvt Ltd.",
    "address": "Ranchi",
    "duration": "28-Aug-2021 to 01-May-2022",
    "positions": [
      {
        "position": "Financial Processor",
        "location": "Ranchi",
        "startDate": "28-August-2021",
        "endDate": "01-May-2022",
        "description": [
          "Handled financial transactions, processed invoices, and ensured accurate financial records.",
          "Managed financial data and coordinated with various departments to ensure proper billing and documentation.",
          "Assisted in maintaining the company's financial health through diligent record-keeping and process optimization."
        ]
      }
    ]
  }
]
